Revit 2027 API
ExternallyTaggedNonBReps.CanAddExternallyTaggedNonBRep Method
 Checks if the input geometry could be added to this collection or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAddExternallyTaggedNonBRep(
	ExternallyTaggedNonBRep geometry
)
Public Function CanAddExternallyTaggedNonBRep (
	geometry As ExternallyTaggedNonBRep
) As Boolean
public:
bool CanAddExternallyTaggedNonBRep(
	ExternallyTaggedNonBRep^ geometry
)
member CanAddExternallyTaggedNonBRep :
        geometry : ExternallyTaggedNonBRep -> bool
Parameters
geometry ExternallyTaggedNonBRep
Return Value
Boolean
 True if we can add the input geometry to this collection, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Duplicate ExternalGeometryIds are prohibited.
See Also
Reference
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace